app/controllers/cross_sale_groups_controller.rb

SELECT * FROM "cross_sale_groups"
SELECT * FROM "cross_sale_groups" WHERE ("cross_sale_groups"."id" = 261211127)
SELECT * FROM "items" INNER JOIN "cross_sale_groups_items" ON "items".id = "cross_sale_groups_items".item_id WHERE ("cross_sale_groups_items".cross_sale_group_id = 261211127 )
---
  def index
    @cross_sale_groups = CrossSaleGroup.all
    if request.xhr?
      csg = CrossSaleGroup.find(params[:id])
      render :update do |page|
        page.remove "cross_sale_group_#{csg.id}_new_item_row"
        csg.items.each {|i| page.remove "cross_sale_group_#{csg.id}_item_#{i.id}_row"}

SELECT "cross_sale_groups".id FROM "cross_sale_groups" WHERE ("cross_sale_groups"."id" = '770293074') LIMIT 1
---
  def show
    if CrossSaleGroup.exists?(params[:id])
      @cross_sale_group = CrossSaleGroup.find(params[:id])

SELECT * FROM "cross_sale_groups" WHERE ("cross_sale_groups"."id" = 261211127)
---
  def edit
    @cross_sale_group = CrossSaleGroup.find(params[:id])

INSERT INTO "cross_sale_groups" ("name", "created_at", "updated_at") VALUES('Acoustics', '2010-02-13 20:41:33', '2010-02-13 20:41:33')
---
  def create
    @cross_sale_group = CrossSaleGroup.new(params[:cross_sale_group])
    if @cross_sale_group.save

SELECT * FROM "cross_sale_groups" WHERE ("cross_sale_groups"."id" = 1)
UPDATE "cross_sale_groups" SET "updated_at" = '2010-02-13 20:41:42', "name" = 'Acoustic' WHERE "id" = 1
---
  def update
    @cross_sale_group = CrossSaleGroup.find(params[:id])
    respond_to do |format|
      if @cross_sale_group.update_attributes(params[:cross_sale_group])

SELECT * FROM "cross_sale_groups" WHERE ("cross_sale_groups"."id" = 770293078)
SELECT * FROM "items" INNER JOIN "cross_sale_groups_items" ON "items".id = "cross_sale_groups_items".item_id WHERE ("cross_sale_groups_items".cross_sale_group_id = 770293078 )
---
  def destroy
    csg = CrossSaleGroup.find(params[:id])
    if request.xhr?
      render :update do |page|
        # Remove main record
        page.remove "record_#{csg.id}_row"
        # Remove new record field if it exists
        page << "if($('cross_sale_group_#{csg.id}_new_item_row')) {"
          page.remove "cross_sale_group_#{csg.id}_new_item_row"
        page << "}"
        # Remove each item row if they exist
        csg.items.each do |i|

SELECT * FROM "cross_sale_groups" WHERE ("cross_sale_groups"."id" = 261211127)
SELECT "items".id FROM "items" INNER JOIN "cross_sale_groups_items" ON "items".id = "cross_sale_groups_items".item_id WHERE ("items"."id" = 664522032) AND ("cross_sale_groups_items".cross_sale_group_id = 770293079 ) LIMIT 1
---
  def associate_item
    cross_sale_group = CrossSaleGroup.find(params[:id])
    if Item.exists?(params[:item_id]) && !cross_sale_group.items.include?(Item.find(params[:item_id]))

SELECT * FROM "cross_sale_groups" WHERE ("cross_sale_groups"."id" = 261211127)
SELECT "items".id FROM "items" INNER JOIN "cross_sale_groups_items" ON "items".id = "cross_sale_groups_items".item_id WHERE ("items"."id" = '664522032') AND ("cross_sale_groups_items".cross_sale_group_id = 261211127 ) LIMIT 1
---
  def dissociate_item
    cross_sale_group = CrossSaleGroup.find(params[:id])
    if cross_sale_group.items.exists?(params[:item_id])