app/controllers/items_controller.rb

SELECT * FROM "items"
---
  def index
    @items = Item.all

INSERT INTO "items" ("name", "created_at", "updated_at", "description") VALUES('Test Item', '2010-02-16 00:45:52', '2010-02-16 00:45:52', 'This item is a test')
---
  def create
    @item = Item.new(params[:item])
    if @item.save

UPDATE "items" SET "updated_at" = '2010-02-16 00:54:16', "description" = 'abcd' WHERE "id" = 947856336
---
  def update
    if @item.update_attributes(params[:item])

DELETE FROM "items" WHERE "id" = 947856337
---
  def destroy
    @item.destroy